#include<stdio.h>
#include<stdlib.h>
#include<math.h>
#include<string.h>
#include "ACO.h"
void Init_Factory_Information_Function(struct factory *factoryInfo)   //初始化工厂信息 
{
	int i;
	/*
	double factoryArrayX[FACTORY_COUNT+1]={14.5,12.8,18.4,15.4,18.9,15.5,
		                                    3.9,10.6,8.6,12.5,13.8,6.7,
										  14.8,1.8,17.1,7.4,0.2,11.9,
										  13.2,6.4,9.6};   	//定义下游工厂和原材料配送工厂的X坐标集,数组长度为FACTORY_COUNT+1
	double factoryArrayY[FACTORY_COUNT+1]={13.0,8.5,3.4,16.6,15.2,11.6,
		                                 10.6,7.6,8.4,2.1,5.2,16.9,
		                                  2.6,8.7,11.0,1.0,2.8,19.8,
										  15.1,5.6,14.8};         //定义下游工厂和原材料配送工厂的Y坐标集,数组长度为FACTORY_COUNT+1
	double factoryArrayD[FACTORY_COUNT+1]={0,0.1,0.4,1.2,1.5,0.8,
											1.3,1.7,0.6,1.2,0.4,0.9,
		                                    1.3,1.3,1.9,1.7,1.1,1.5,
											 1.6,1.7,1.5};               //定义下游工厂和原材料配送工厂的原材料需求量,数组长度为FACTORY_COUNT+1
	*/
	double factoryArrayX[FACTORY_COUNT+1]={14.5,35.6,3.1,27.9,16.6,9.3,32.0,31.1,18.0,4.2,29.9,
												26.0,14.7,42.6,17.1,3.0,15.9,1.4,5.4,29.5,26.1,
												5.0,25.2,25.4,14.4,34.0,9.9,11.4,11.8,8.3,11.6,
												9.0,2.6,13.6,13.0,8.9,29.9,2.0,31.0,23.0,13.1,
												30.3,40.3,1.1,18.9,14.6,2.0,19.9,13.5,48.7,34.9,
		                                        25.3,3.0,7.0,0.2,1.1,43.5,4.0,28.9,34.0,25.0,
		                                        33.3,1.6,12.8,29.1,24.6,16.6,33.2,17.2,29.9,14.6,
		                                        1.1,11.4,27.5,36.9,2.0,21.8,3.2,35.7,27.3,23.2,
												26.2,35.6,50.1,24.0,27.1,18.9,7.7,29.4,8.1,4.9,  
												33.2,29.3,42.1,25.1,15.0,18.0,17.2,15.0,12.5,21.2};//定义下游工厂和原材料配送工厂的X坐标集,数组长度为FACTORY_COUNT+1    */
	double factoryArrayY[FACTORY_COUNT+1]={13.0,47.1,12.0,59.3,40.0,7.8,23.9,7.6,15.7,19.0,32.8,  
												 17.4,0.5,20.7,6.3,17.0,32.0,28.6,2.6,41.8,23.6,   
												  11.0,21.2,4.0,7.0,54.2,21.5,8.8,27.4,3.3,5.6,
												  40.7,10.2,19.9,20.2,34.2,17.9,0.8,7.4,29.1,39.6,
												  45.8,5.1,43.4,12.1,41.2,26.8,52.3,44.1,23.5,24.6,
												  20.6,19.2,10.2,29.1,36.8,26.1,30.3,39.7,0.5,28.2,
												4.7,30.3,18.1,17.5,19.1,22.6,32.5,14.4,38.7,26.7,
												25.5,22.6,27.4,19.2,7.5,21.2,39.8,23.9,8.7,43.1,
												35.7,27.8,11.6,20.6,18.1,30.7,1.2,11.6,3.6,24.3,
												38.8,45.8,8.4,2.4,16.9,3.2,23.4,25.6,26.2,8.9};//定义下游工厂和原材料配送工厂的Y坐标集,数组长度为FACTORY_COUNT+1   */
	double factoryArrayD[FACTORY_COUNT+1]={0,3.38,5.80,3.68,8.93,5.49,10.16,5.56,7.81,8.71,7.79,
		                                     9.30,9.70,4.67,2.57,1.84,6.06,6.71,9.03,1.65,0.79,
		                                     5.44,8.54,11.30,2.38,9.85,6.02,5.28,11.20,13.32,12.11,
											 4.85,7.66,10.99,7.13,1.80,0.08,10.47,2.06,7.78,5.32,
											 4.57,6.35,10.67,5.56,11.15,21.56,14.49,0.43,8.43,7.11,
											 6.47,2.43,4.00,15.63,11.75,6.23,6.95,7.42,9.15,6.88,
											 2.70,5.71,13.49,2.86,13.16,10.05,12.33,7.95,9.46,3.37,
											 12.36,1.73,2.85,12.93,11.41,3.96,10.04,3.26,6.90,12.34,
											 2.49,11.36,13.54,7.11,4.17,5.28,12.13,10.29,1.99,12.86,
											7.37,2.90,5.70,14.48,7.92,6.86,13.19,1.76,10.17,12.83};//定义下游工厂和原材料配送工厂的原材料需求量,数组长度为FACTORY_COUNT+1  */
	
	for (i=0;i<FACTORY_COUNT+1;i++)	         //初始化工厂信息
	{	
		factoryInfo[i].factoryX=factoryArrayX[i];          //初始化各下游工厂和配送中心的的X坐标
		factoryInfo[i].factoryY=factoryArrayY[i];          //初始化各下游工厂和配送中心的的Y坐标
		factoryInfo[i].factoryD=factoryArrayD[i];		   //初始化各下游工厂和配送中心的的需求，其中配送中心的需求为0T
	}
	return ;
}

void Init_Pheromone_Information_Function(double (*pheromone)[FACTORY_COUNT+1])  //初始化各条边上的信息素浓度
{
	int i,j;
	for (i=0;i<FACTORY_COUNT+1;i++)
	{
		for (j=0;j<FACTORY_COUNT+1;j++)
		{
			if (i!=j)    //i和j相同表示一个点，不表示边
			{
				pheromone[i][j]=INIT_PHEROMONE;    //计算i和j之间的距 
			}			
		}
	}
    return ;
}
void Ant_Information_Function(struct ant *antInfo)   //初始化蚂蚁信息
{
	int i,j;
	for (i=0;i<ANT_COUNT;i++)
	{
		antInfo[i].totalWork=0;
		for (j=0;j<FACTORY_COUNT+2;j++)
		{
			antInfo[i].tabuRoute[j]=0;
		}
		
	}
	return ;
}

void Init_Distance_Information_Function(struct factory *factoryInfo,double (*distance)[FACTORY_COUNT+1])  //初始化各个下游工厂以及供应商的距离矩阵   
{                                                                     //二维数组distance的传递
	int i,j;
	for (i=0;i<FACTORY_COUNT+1;i++)
	{		
		for (j=0;j<FACTORY_COUNT+1;j++)
		{
			distance[i][j]=Distance_Function(i,j,factoryInfo);  //计算i和j之间的距
		}
	}
    return ; 
}